In [ ]:
# Hier ist nur Code zum Initialisieren der Umgebeung, bitte gehen Sie weiter, es gibt nichts zu sehen.

# Keine langen Fehlermeldungen
import sys
ipython = get_ipython()

def exception_handler(exception_type, exception, traceback):
    print("%s: %s" % (exception_type.__name__, exception), file=sys.stderr)

ipython._showtraceback = exception_handler

# Lade die Erweiterung, damit wir SQL Befehle nutzen k√∂nnen
%load_ext sql

# Verbinde Dich zu einer in - Memory Datenbank
%sql sqlite:///
%sql PRAGMA foreign_keys = ON

In [42]:
%%sql


DROP TABLE IF EXISTS Bestellung;
DROP TABLE IF EXISTS Kunde;

CREATE TABLE Kunde (
    Kundennummer INTEGER NOT NULL,
    Vorname TEXT DEFAULT 'Anonymous',
    Nachname TEXT CONSTRAINT ImmerNachname NOT NULL,
    Wohnort TEXT,
    Plz INTEGER CHECK (Plz BETWEEN 9999 AND 100000),
    PRIMARY KEY (Kundennummer)
);

CREATE TABLE Bestellung (
    Bestellnummer INTEGER NOT NULL,
    Kunde INTEGER,
    Bestelldatum TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    Article TEXT,
    PRIMARY KEY (Bestellnummer),
    FOREIGN KEY (Kunde) REFERENCES Kunde(Kundennummer)
);

 * sqlite:///
Done.
Done.
Done.
Done.

[]

In [43]:
%%sql

INSERT INTO Kunde (Nachname) VALUES ('Bu');
INSERT INTO Kunde (Vorname, Nachname, Wohnort, Plz) VALUES ('Jimmy', 'Tanh', 'Deggendorf', '94469');

 * sqlite:///
1 rows affected.
1 rows affected.

[]

In [44]:
%%sql

SELECT *
FROM Kunde

 * sqlite:///
Done.

[(1, 'Anonymous', 'Bu', None, None), (2, 'Jimmy', 'Tanh', 'Deggendorf', 94469)]

In [45]:
%%sql

INSERT INTO Bestellung (Kunde, Article) VALUES (1, 'Apple'), (1, 'Pear'), (2, 'Lemon');
INSERT INTO Bestellung (Kunde) VALUES (1);

 * sqlite:///
3 rows affected.
1 rows affected.

[]

In [46]:
%%sql

SELECT *
FROM Bestellung

 * sqlite:///
Done.

[(1, 1, '2024-01-29 18:13:18', 'Apple'),
 (2, 1, '2024-01-29 18:13:18', 'Pear'),
 (3, 2, '2024-01-29 18:13:18', 'Lemon'),
 (4, 1, '2024-01-29 18:13:18', None)]

In [57]:
%%sql

DROP VIEW IF EXISTS Sales01;

CREATE VIEW Sales01
AS
SELECT Kundennummer,COUNT(*) AS AnzahlBestellungen FROM Kunde, 
Bestellung WHERE Bestellung.Kunde = Kunde.Kundennummer GROUP BY Kundennummer

 * sqlite:///
Done.
Done.

[]

In [55]:
%sql SELECT * FROM Sales01;

 * sqlite:///
Done.

[(1, 3), (2, 1)]

In [59]:
%%sql

SELECT * FROM Sales01;

 * sqlite:///
Done.

[(1, 3), (2, 1)]